
#Область ПрограммныйИнтерфейс

Процедура ВКМ_ОтправитьСообщениеВТелеграмм() Экспорт
	
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_УведомленияТелеграмБоту.Ссылка,
		|	ВКМ_УведомленияТелеграмБоту.ТекстСообщения
		|ИЗ
		|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту";
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Результат = ОтправитьСообщение(Выборка.ТекстСообщения);
				
		Если Результат <> Неопределено И Результат.КодСостояния = 200 Тогда
			СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
			СправочникОбъект.Удалить();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры


//Отправка сообщения в телеграм
//Параметры: Текст сообщения - строка
//Возврат: HTTP ответ
Функция ОтправитьСообщение(ТекстСообщения) Экспорт
	
	
	ТокенБота = Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить();
	ChatID = Константы.ВКМ_ИдентификаторГруппыДляОповещенияВКМ.Получить();
	
	
	// Формируем URL для отправки сообщения
    URL = "https://api.telegram.org/bot" + ТокенБота + "/sendMessage";

    // Параметры запроса
    Параметры = Новый Структура;
    Параметры.Вставить("chat_id", ChatID);
    Параметры.Вставить("text", ТекстСообщения);

    // Создаем HTTP-запрос
    Запрос = Новый HTTPЗапрос;
    Запрос.Адрес = URL;
    Запрос.Заголовки.Вставить("Content-Type", "application/json");
    Запрос.УстановитьТелоИзСтроки(ЗаписатьЗначениеJSON(Параметры));

    // Отправляем запрос
    HTTP = Новый HTTPСоединение("api.telegram.org");
    Ответ = HTTP.Получить(Запрос);

    // Обработка ответа
    Если Ответ.КодСостояния = 200 Тогда
        Сообщить("Сообщение успешно отправлено!");
    Иначе
        Сообщить("Ошибка при отправке сообщения: " + Ответ.КодСостояния);
    КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции



#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти
