
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МаксимальноеЧислоДней = Константы.ВКМ_МаксимальноеЧислоДнейОтпуска.Получить();
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ЗаполнитьСотрудников(Команда)
	
		ЗаполнитьСотрудниковНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура АнализГрафика(Команда)
	
		Адрес = ПоместитьДанныеВоВременноеХранилище();
	
	Если Адрес <> Неопределено И ЗначениеЗаполнено(Адрес) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Адрес",Адрес);
		ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы);
	КонецЕсли;
	
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаполнитьСотрудниковНаСервере()
		
	УсловноеОформление.Элементы.Очистить();
	Объект.ОтпускаСотрудников.Очистить();
	
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ФизическиеЛица.Ссылка
		|ИЗ
		|	Справочник.ВКМ_ФизическиеЛица КАК ВКМ_ФизическиеЛица";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Объект.ОтпускаСотрудников.Добавить().Сотрудник = Выборка.Ссылка;
	КонецЦикла;
	
КонецПроцедуры



&НаСервере
Функция ПоместитьДанныеВоВременноеХранилище()
	
	СтруктураДанных = Новый Структура;
	ДанныеТаблицы = Объект.ОтпускаСотрудников.Выгрузить();
	СтруктураДанных.Вставить("ДанныеТаблицы", ДанныеТаблицы);
	СтруктураДанных.Вставить("Год", Объект.Год);
	Адрес = ПоместитьВоВременноеХранилище(СтруктураДанных);
	Возврат Адрес;
	
КонецФункции


#КонецОбласти
