
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ФоновоеСозданиеАктов(Период) Экспорт
	Результат = Новый Структура;
	МассивСтрок = Новый Массив;
	
	СозданоДокументов = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК РеализацияСсылка,
		|	РеализацияТоваровУслуг.Договор
		|ПОМЕСТИТЬ ВТ_Реализации
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ПЕРИОД, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ПЕРИОД, МЕСЯЦ)
		|	И НЕ РеализацияТоваровУслуг.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
		|	ЕСТЬNULL(ВТ_Реализации.РеализацияСсылка, ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)) КАК
		|		РеализацияСсылка,
		|	ДоговорыКонтрагентов.Организация,
		|	ДоговорыКонтрагентов.ВидДоговора,
		|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
		|	ДоговорыКонтрагентов.ВКМ_СуммаАбонентскойПлаты
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Реализации КАК ВТ_Реализации
		|		ПО ДоговорыКонтрагентов.Ссылка = ВТ_Реализации.Договор
		|ГДЕ
		|	ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентсткоеОбслуживание)
		|	И НАЧАЛОПЕРИОДА(ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора, МЕСЯЦ) <= &Период
		|	И КОНЕЦПЕРИОДА(ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора, МЕСЯЦ) >= &Период";
	
	Запрос.УстановитьПараметр("Период", Период);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	ВсегоОбъектов = Выборка.Количество();
	ОбработаноОбъектов = 0;
	ПустаяСсылка = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
	
	Пока Выборка.Следующий() Цикл
		СтрокаДанных = Новый Структура("Договор, РеализацияТоваровИУслуг, СозданАвтоматически");
		СтрокаДанных.Договор = Выборка.Договор;
		
		Если Выборка.РеализацияСсылка = ПустаяСсылка Тогда
			СсылкаНаДокумент = СоздатьДокументРеализацияТоваровУслуг(Выборка, Период);
			Если Не СсылкаНаДокумент = ПустаяСсылка Тогда 
				СозданоДокументов = СозданоДокументов + 1;
				СтрокаДанных.СозданОбработкой = Истина;
			КонецЕсли;
		Иначе
			СсылкаНаДокумент = Выборка.РеализацияСсылка;
			СтрокаДанных.СозданОбработкой = Ложь;
		КонецЕсли;
		
		СтрокаДанных.РеализацияТоваровИУслуг = СсылкаНаДокумент;
		
		МассивСтрок.Добавить(СтрокаДанных);
		ОбработаноОбъектов = ОбработаноОбъектов + 1;
		ДлительныеОперации.СообщитьПрогресс(ОбработаноОбъектов / ВсегоОбъектов * 100);
		
	КонецЦикла;
	Результат.Вставить("МассивСТрок", МассивСтрок);
	Результат.Вставить("СозданоДокументов", СозданоДокументов);
	
	Возврат Результат;
	
КонецФункции

Функция СоздатьДокументРеализацияТоваровУслуг(Выборка, Период)
	
	Ссылка = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
	
	НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(НовыйДокумент, Выборка);
	
	НовыйДокумент.Дата = КонецМесяца(Период);
	НовыйДокумент.Ответственный = Пользователи.ТекущийПользователь();
	НовыйДокумент.Комментарий = "Реализации созданы обработкой ""Массовое создание актов""";
	НовыйДокумент.ВКМ_ВыполнитьАвтозаполнение();

	Если НовыйДокумент.ПроверитьЗаполнение() Тогда
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		Ссылка = НовыйДокумент.Ссылка;
	КонецЕсли;
	
	Возврат Ссылка;
	
КонецФункции

#КонецОбласти

#КонецЕсли
