
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Адрес = "";
	
	Если Параметры.Свойство("Адрес", Адрес) Тогда
		СтруктураДанных = ПолучитьИзВременногоХранилища(Адрес);
		Год = СтруктураДанных.Год;
		ТабличнаяЧасть.Загрузить(СтруктураДанных.ДанныеТаблицы);
	КонецЕсли;
	
	МаксимальноеЧислоДней = Константы.ВКМ_МаксимальноеЧислоДнейОтпуска.Получить();
	
	ЗаполнитьДиаграммуНаСервере();
	
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


&НаСервере
Процедура ЗаполнитьДиаграммуНаСервере()
	
	ГрафикОтпусков.Очистить();
	ГрафикОтпусков.Обновление = Ложь;
	ГрафикОтпусков.АвтоОпределениеПолногоИнтервала = Ложь;
	ГрафикОтпусков.УстановитьПолныйИнтервал(НачалоГода(Год),КонецГода(Год));
	
	ЭлементМеток = ГрафикОтпусков.ОбластьПостроения.ШкалаВремени.Элементы.Добавить();
	ЭлементМеток.Единица = ТипЕдиницыШкалыВремени.Месяц;;
	ЭлементМеток.ЛинииДелений = Новый Линия(ТипЛинииДиаграммы.Пунктир, 2);
	
	ЭлементМеток.Формат = "ДФ=MMММ;";
	
	Серия = ГрафикОтпусков.УстановитьСерию("Отпуск");
	Серия.ШтриховкаПерекрывающихсяИнтервалов = Истина;
	Серия.ПриоритетЦвета = Истина;
		
	Для Каждого СтрокаТЧ Из ТабличнаяЧасть Цикл
		
		Точка = ГрафикОтпусков.УстановитьТочку(СтрокаТЧ.Сотрудник);
		
		Значение = ГрафикОтпусков.ПолучитьЗначение(Точка, Серия);
		Значение.Данные.ДнейОтпуска = Значение.Данные.ДнейОтпуска + СтрокаТЧ.ДнейОтпуска;
		
		Если Значение.Данные.ДнейОтпуска > МаксимальноеЧислоДней Тогда
			
			Точка.ЦветФона = WebЦвета.ЛососьСветлый;
			
		ИначеЕсли Значение.Данные.ДнейОтпуска < МаксимальноеЧислоДней Тогда
			
			Точка.ЦветФона = WebЦвета.СветлоЖелтый;
			
		ИначеЕсли Значение.Данные.ДнейОтпуска = МаксимальноеЧислоДней Тогда
			
			Точка.ЦветФона = WebЦвета.БледноЗеленый;
			
		КонецЕсли;
		
		Интервал = Значение.Добавить(); 
		Интервал.Начало = СтрокаТЧ.ДатаНачала;
		Интервал.Конец = СТрокаТЧ.ДатаОкончания;
		
	КонецЦикла;
	
	ГрафикОтпусков.Обновление = Истина;

КонецПроцедуры


#КонецОбласти
