
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Сотрудник,
		|	ВЫБОР
		|		КОГДА ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания >= ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала
		|			ТОГДА СУММА(РАЗНОСТЬДАТ(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала,
		|				ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания, ДЕНЬ) + 1)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ДнейОтпуска,
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.НомерСтроки КАК НомерСтроки,
		|	ВКМ_МаксимальноеЧислоДнейОтпуска.Значение КАК МаксимумДнейОтпуска,
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала,
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания
		|ИЗ
		|	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников,
		|	Константа.ВКМ_МаксимальноеЧислоДнейОтпуска КАК ВКМ_МаксимальноеЧислоДнейОтпуска
		|ГДЕ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник,
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания,
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала,
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.НомерСтроки,
		|	ВКМ_МаксимальноеЧислоДнейОтпуска.Значение
		|ИТОГИ
		|	СУММА(ДнейОтпуска),
		|	МИНИМУМ(НомерСтроки),
		|	МИНИМУМ(МаксимумДнейОтпуска)
		|ПО
		|	Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);


	Движения.ВКМ_ГрафикОтпусков.Записывать = Истина;
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ВКМ_ГрафикОтпусков.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.ДнейОтпуска = Выборка.ДнейОтпуска;
		
		Если Выборка.ДнейОтпуска > Выборка.МаксимумДнейОтпуска Тогда
			
			Сообщение = Новый СообщениеПользователю();
			ТекстСообщения = СтрШаблон("У сотрудника %1 превышено максимальное количество дней отпуска", Выборка.Сотрудник);
			Сообщение.Текст = ТекстСообщения;
			Сообщение.Сообщить();
			Отказ = Истина;
			
		КонецЕсли;
		
		Выборка = Выборка.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.ДатаНачала > Выборка.ДатаОкончания Тогда
				
				Сообщение = Новый СообщениеПользователю();
				ТекстСообщения = СтрШаблон("У сотрудника %1 неверно задан период отпуска", Выборка.Сотрудник);
				Сообщение.Текст = ТекстСообщения;
				Сообщение.Сообщить();
				Отказ = Истина;
				
			КонецЕсли;
			
		КонецЦикла;

	КонецЦикла;
	
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
