
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ОтправитьСообщениеВТелеграм(Команда)
	ОтправитьСообщениеВТелеграмНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыБота(Команда)
	
	ПараметрыФормы = Новый Структура("", );
	ОткрытьФорму("ОбщаяФорма.ВКМ_ПараметрыБота", ПараметрыФормы);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ОтправитьСообщениеВТелеграмНаСервере()
	
	
	Ответ = ВКМ_Телеграм.ОтправитьСообщение(Текст).ПолучитьТелоКакСтроку();

	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(Ответ);
	СодержимоеОтвета = ПрочитатьJSON(Чтение);
	Чтение.Закрыть();
	   
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку(Новый ПараметрыЗаписиJSON(,Символы.Таб));
   	ЗаписатьJSON(Запись, СодержимоеОтвета,);
	
	
КонецПроцедуры
#КонецОбласти
